pipeHeatTransfer/cases/laminarCase/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
  
  {
    name    pressurePlace;
    type    cellSet;
    action  new;
    source  boxToCell;
    sourceInfo
    {
      box (-0.005 -0.005 0.049) (0.005 0.005 0.051);
    }
  } 

  {
    // Mandatory (inherited) entries
    name        outputFace;
    type        faceZoneSet;
    action      new;

    source      planeToFaceZone;
    point       (0 0 0.5);
    normal      (0 0 1);
  }
);



// ************************************************************************* //
